In [1]:
import pandas as pd

# データフレームの作成
data = {"Name":["Alice","Bob","Charlie","David"],
        "Age":[25,30,35,40],
        "Salary": [50000, 60000, 70000, 80000]}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000

In [2]:
# 列 Name と Salary を選択する。
cols = ["Name","Salary"]
df[cols]

      Name  Salary
0    Alice   50000
1      Bob   60000
2  Charlie   70000
3    David   80000

In [ ]:
# 行 Age > 30 のデータを抽出する。


cols = df[df["Age"] > 30]
cols

      Name  Age  Salary
2  Charlie   35   70000
3    David   40   80000

In [8]:
# 列 Salary の平均値を計算する。
df["Salary"].mean()

np.float64(65000.0)